Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/runsc/go-httpd/target_count_8/repeat_1/2.txt
2020/01/20 11:54:52 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8002/
2020/01/20 11:55:22 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 30280 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8002
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      30280
Failed requests:        0
Total transferred:      4330040 bytes
HTML transferred:       787280 bytes
Requests per second:    1009.33 [#/sec] (mean)
Time per request:       99.076 [ms] (mean)
Time per request:       0.991 [ms] (mean, across all concurrent requests)
Transfer rate:          140.95 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   9.8      3     138
Processing:     0   93  73.2     70     342
Waiting:        0   92  73.1     69     342
Total:          1   99  73.8     76     394
Percentage of the requests served within a certain time (ms)
  50%     76
  66%    110
  75%    143
  80%    185
  90%    219
  95%    233
  98%    253
  99%    272
 100%    394 (longest request)
{"connect":{"max":138,"mean":6,"median":3,"min":0,"stdDev":9.800000190734863},"percentiles":{"100":394,"50":76,"66":110,"75":143,"80":185,"90":219,"95":233,"98":253,"99":272},"processing":{"max":342,"mean":93,"median":70,"min":0,"stdDev":73.19999694824219},"total":{"max":394,"mean":99,"median":76,"min":1,"stdDev":73.80000305175781},"waiting":{"max":342,"mean":92,"median":69,"min":0,"stdDev":73.0999984741211}}
2020/01/20 11:55:22 Matched stat line [Connect:        0    6   9.8      3     138 Connect 0 6 9.8 3 138]
2020/01/20 11:55:22 Matched stat line [Processing:     0   93  73.2     70     342 Processing 0 93 73.2 70 342]
2020/01/20 11:55:22 Matched stat line [Waiting:        0   92  73.1     69     342 Waiting 0 92 73.1 69 342]
2020/01/20 11:55:22 Matched stat line [Total:          1   99  73.8     76     394 Total 1 99 73.8 76 394]
2020/01/20 11:55:22 Matched percentline [  50%     76 50 76]
2020/01/20 11:55:22 Matched percentline [  66%    110 66 110]
2020/01/20 11:55:22 Matched percentline [  75%    143 75 143]
2020/01/20 11:55:22 Matched percentline [  80%    185 80 185]
2020/01/20 11:55:22 Matched percentline [  90%    219 90 219]
2020/01/20 11:55:22 Matched percentline [  95%    233 95 233]
2020/01/20 11:55:22 Matched percentline [  98%    253 98 253]
2020/01/20 11:55:22 Matched percentline [  99%    272 99 272]
2020/01/20 11:55:22 Matched percentline [ 100%    394 100 394]